[
    {
        "id": "0",
        "msg": 
        [
            "\"greetings\"",
            "[Roulx stands in front of you, distant, familiar, close. It has been some years after, since it all happened... The people, the scheming, the lights. Isn't it all more than a memory?]",
            "",
            "[They stand there in front of you, seemingly stunned as the tapping of their fingers stands frozen mid-action.]"
        ],
        "options": [
            {
                "option": "[Pretend not to notice.]"
            },
            {
                "option": "[Begin to walk away.]",
                "jumpto": [
                    "2(1)",
                    "2(2)"
                ],
                "chance": [
                    0.5,
                    0.5
                ]
            },
            {
                "option": "\"... Roulx?\""
            }
        ]
    },
    {
        "id": "3",
        "msg": 
        [
            "[Ki seemed to shiver at that. Barely noticeable, but you've known kime for long enough.]",
            "Roulx: \"Olive? You're here!\"",
            "[They smile, relieved as they comprehend your presence.]"
        ],
        "options": [
            {
                "option": "[Smile back.]"
            },
            {
                "option": "[Leave. This was a bad idea.]"
            },
            {
                "option": "\"...\""
            }
        ]
    },
    {
        "id": "31",
        "msg": 
        [
            "[You smile back at them. They are your friend. Smiling is the polite thing to do.]",
            "Roulx: \"How have you been?\"",
            "[It stands, the two its hands gloved, clasped in front of itself idly.]",
            "[...]"
        ],
        "options": [
            {
                "option": "\"...Roulx. I'm not Olive.\""
            }
        ]
    },
    {
        "id": "311",
        "msg": 
        [
            "[Their smile lowers, but doesn't disappear as they tilt their head.]",
            "Roulx: \"What do you mean? ... You look just like him?\"",
            "\"Autumn. My name is Autumn. You must have confused me for someone else.\"",
            "Roulx: \"Autumn? You're Autumn?.. Do you,, well you don't but... Do you know of someone by the name Olive Stanford?\""
        ],
        "options": [
            {
                "option": "\"No. I do not.\""
            }
        ]
    },
    {
        "id": "3111",
        "msg":
        [
            "Roulx: \"...Alright...\"",
            "",
            "[It shifts in its stance. Looking down to the side... It wears the same white suit and outfit from the very before, yellow bow tie sitting in the exact same.]",
            "Roulx: \"Well, nice to meet you Autumn, though you already know my name.\"",
            "[Roulx reaches out a gloved right hand, to shake in polite greeting.]",
            "",
            "[You shake hands. It is a familiar feeling, a warm feeling. Having an ally on your side.]",
            "\"Nice to meet you too, Roulx.\""
        ],
        "options": [
            {
                "option": "\"How are you?\""
            },
            {
                "option": "\"Why are you here?\""
            },
            {
                "option": "\"Could we talk somewhere else? I'm not a big fan of crowded areas.\""
            }
        ]
    },
    {
        "id": "31112",
        "msg":
        [
            "[They look around, the store seems spacious, Roulx themself have new earrings and a shoulder tote bag of books and trinkets.]",
            "Roulx: \"I'm only here to buy things for my Hugo. We're stopping near by for sightseeing and business.\"",
            "",
            "[They shrug. A swing and there some badges and trinkets clink against each other on the surface of their bag.]"
        ],
        "options": [
            {
                "option": "\"I like your earrings.\""
            },
            {
                "option": "\"Those badges look lovely. They suit you.\""
            },
            {
                "option": "\"Hugo? Are they your partner?\""
            },
            {
                "option": "\"Looks like you've bought quite a bit. Are you looking for anything else?\""
            }
        ]
    },
    {
        "id": "311121",
        "msg":
        [
            "Roulx: \"Thanks! These are new, my partner gave me them for our anniversary last year.\"",
            "[Gold in material, the left one is a delicate replication of a moon. Simple, small and sways side to side as it tilts in its expressiveness. The right one, much more complicated, rings engraved with patterns and fancy symbols that are too small to read, rings layering on top of eachother, but which all idly spins in momentum with Roulx's movements.]"
        ],
        "options": [
            {
                "option": "\"Do you like the moon?\""
            },
            {
                "option": "\"What do those engravings say?\"",
                "pop": [
                    "Roulx: \"Oh this. It's some vows that are stars and astronomy themed.\"",
                    "[They take it off, turning its rings around to expose most of its engravings out. The gold glistens with a tarnished luster, the termination of light blurs on the metal.]",
                    "Roulx: \"I don't understand all of them, I'm not too invested in stars. But I like it!\"",
                    "\"I'm sure the vows are as elegant as they appear.\""
                ]
            },
            {
                "option": "\"Wow, those must have been expensive.\""
            },
            {
                "option": "\"Your partner's got taste.\""
            },
            {
                "option": "\"Hugo, right? Congratulations.\""
            }
        ]
    },
    {
        "id": "3111211",
        "msg":
        [
            "Roulx: \"The moon!! Yes, of course.\"",
            "[They look to Autumn with excitement!]",
            "Roulx: \"I well, have it as an earring because me and Hugo were married on the moon! It's rather romantic,.. But also yes, I do quite like the moon for all its beauty in the night sky.\"",
            "",
            "[A left hand touches the earring fondly. Gayass.]"
        ],
        "options": [
            {
                "option": "\"How did you manage that???\""
            },
            {
                "option": "\"That's cute. Congratulations!\""
            }
        ],
        "wedding": true
    },
    {
        "id": "31112112",
        "msg": 
        [
            "[\"I didn't know you two were—\"]",
            "",
            "\"That's cute. Congratulations!\"",
            "[You say with a grin.]",
            "",
            "[Ki smiles, lulling kir bag over kir shoulders again.]",
            "Roulx: \"How have you been? It's been a long time since we'd last talked.\"",
            "\"It certainly has.\""
        ],
        "options": [
            {
                "option": "\"There've been a lot of changes, but recently it's been peaceful. I'm doing alright.\""
            },
            {
                "option": "\"I couldn't have asked for much more.\""
            },
            {
                "option": "\"Actually... Could we talk somewhere else? I'm not a big fan of crowded areas.\"",
                "jumpto": "31113"
            }
        ]
    },
    {
        "id": "31113",
        "msg": 
        [
            "Roulx: \"Sure of course. It's been sometime since we properly talked. I don't enjoy crowded places either.\"",
            "[It looks around, glancing at the structures and the low hanging lights overhead.]",
            "Roulx: \"you lead the way.\"",
            "\"Alright.\""
        ],
        "options": [
            {
                "option": "[You head to a park.]"
            },
            {
                "option": "[You head to a local cafe.]"
            },
            {
                "option": "[You head to a library in the mall.]"
            }
        ]
    },
    {
        "id": "311132",
        "msg":
        [
            "\"..How do you feel about birds, Roulx?\"",
            "Roulx: \"I like them. But am otherwise neutral to their existence. Why do you ask?\"",
            "[Ki strolls slightly to your right, only a step behind.]",
            "\"Nice. I think you wouldn't mind it there then. Come with me.\"",
            "",
            "[It's about an 8 minute walk from where you are until you reach a slightly less populated suburban area, where a stylish cafe stands with a raised wooden deck and circular white tables and parasols on its outside. The name \"Haven's Parrot\" is written in a chocolatey brown font on its front in cursive. There are some people at this time of day but it is not entirely packed, and there's plenty of polished wooden tables and orange cushions to sit at on the inside.]",
            "\"I quite like this cafe,\" [you say after greeting a waiter, asking for two seats inside.] \"It's usually pretty quiet, but the people I do meet here are incredibly kind. They also renovated recently, that's why the outside looks so new.\"",
            "",
            "[Roulx curiously peers its head around the space.]",
            "Roulx: \"it does look cosy.\"",
            "[It does, it does. It heads to take a seat, one that's orange against the wall.]",
            "[You sit down opposite of Roulx. It's soft. You've always liked sitting at cushioned benches at restaurants.]"
        ],
        "options": [
            {
                "option": "\"Do you want to order anything? The drinks here are nice.\""
            },
            {
                "option": "\"It is. I come here sometimes just for some fresh air, listen to an audiobook or something. Or to meet up with people on occasion.\"",
                "chased_option": null
            },
            {
                "option": "\"Yeah. So, what were we talking about before?\"",
                "chased_option": "\"What were we talking about before?\""
            }
        ],
        "location": "cafe"
    },
    {
        "id": "3111321",
        "msg": 
        [
            "Roulx: \"I don't think I'll have anything. A cup of water, maybe.\"",
            "[Its bag remains on its shoulder, the back of its hand visible on the wooden table. Its politeness still unchanged.]"
        ],
        "options": [
            {
                "option": "\"Alright. Maybe I'll just have that too.\"",
                "chased_option": "\"Two waters, then.\""
            },
            {
                "option": "\"I'll get a latte. Tends to be the usual choice.\"",
                "chased_option": "\"I'll have a latte.\""
            },
            {
                "option": "[Smile.] \"Please make yourself comfortable.\"",
                "chased_option": null
            }
        ]
    },
    {
        "id": "31113212",
        "msg": 
        [
            "[You call up the waiter again and ask for some water, as well as your usual selection of cinnamon iced latte. They make good coffee here.]",
            "Roulx: \"Alrighty.\"",
            "",
            "[Ki leans, tapping a hand on the table mindlessly.]",
            "[You take a sip of the latte, served to you atop a small black plate and along with a ceramic teaspoon.",
            "Mmm. Cold. There's just something inexplicably satisfying about having a cold drink in the middle of winter.]"
        ],
        "options": [
            {
                "option": "\"Are you sure you don't want anything else?\""
            },
            {
                "option": "\"How is Hugo doing?\""
            },
            {
                "option": "\"Yeah. So, what were we talking about before?\""
            }
        ]
    },
    {
        "id": "311132122",
        "msg": 
        [
            "Roulx: \"He's been doing fine. It wouldn't've been a long time since he'd left. But I'll say that he's doing fine.\"",
            "[It takes its tastes of the water. Lukewarm.]",
            "",
            "Roulx: \"What did you think of him?\""
        ],
        "options": [
            {
                "option": "\"He certainly lightens the room with his presence. Charismatic, might be the word. They're a good fit for you, I think. Is he good to you?\""
            },
            {
                "option": "\"Honestly I don't think I know them as well as I could have, but they seemed like a good person. Friendly, easy to talk to. What do *you* think of him?\""
            },
            {
                "option": "\"He's a time traveller, right? We talked a few times, he told me about some of his journeys. There must be so much going on out there, I can't possibly imagine. Do you two travel often?\""
            }
        ]
    },
    {
        "id": "2(1)",
        "msg": 
        [
            "Roulx: \"Olive Stanford.\"",
            "[They attempt to walk up to your side.]"
        ],
        "options": [
            {
                "option": "[Freeze.]"
            },
            {
                "option": "[Turn to them.]"
            },
            {
                "option": "[Keep walking. Deep breaths.]",
                "jumpto": [
                    "2(1)3",
                    "2(2)"
                ],
                "chance": [
                    0.3333333333333333,
                    0.6666666666666666
                ]
            }
        ]
    },
    {
        "id": "2(1)2",
        "msg": 
        [
            "Roulx: \"Good afternoon.\"",
            "[Roulx stares at you with a piercing gaze. Seething, to see right through you.]"
        ],
        "options": [
            {
                "option": "\"...Roulx?\"",
                "jumpto": "2(1)31"
            },
            {
                "option": "[Break into a run. (Roll for running.)]",
                "jumpto": [
                    "2(1)33(3)",
                    "2(1)33(2)",
                    "2(1)33(1)"
                ],
                "chance": [
                    0.25,
                    0.25,
                    0.5
                ],
                "pre_scene": "[They run after you. Though your crowded surroundings make obstacles for you.]"
            }
        ]
    },
    {
        "id": "2(1)3",
        "msg": 
        [
            "Roulx: \"Hey!\"",
            "[They call out for you again, catching up with a trot. Your sight greets the corners of a patch of white.]"
        ],
        "options": [
            {
                "option": "[Give up.]"
            },
            {
                "option": "[Keep walking.]",
                "jumpto": [
                    "2(1)32",
                    "2(2)"
                ],
                "chance": [
                    0.6666666666666666,
                    0.3333333333333333
                ]
            },
            {
                "option": "[Break into a run. (Roll for running.)]",
                "jumpto": [
                    "2(1)33(3)",
                    "2(1)33(2)",
                    "2(1)33(1)"
                ],
                "chance": [
                    0.25,
                    0.25,
                    0.5
                ],
                "pre_scene": "[They run after you. Though your crowded surroundings make obstacles for you.]"
            }
        ]
    },
    {
        "id": "2(1)32",
        "msg": 
        [
            "[The person doesn't hesitate anymore, hopping in front of you directly blocking your path.]",
            "",
            "Roulx: \"Hey.\"",
            "[...]"
        ],
        "options": [
            {
                "option": "[Feign innocence.]",
                "jumpto": "2(1)31"
            },
            {
                "option": "[Freeze.]",
                "jumpto": "2(1)1"
            },
            {
                "option": "[Break into a run. (Roll for running.)]",
                "jumpto": [
                    "2(1)33(3)",
                    "2(1)33(2)",
                    "2(1)33(1)"
                ],
                "chance": [
                    0.25,
                    0.25,
                    0.5
                ],
                "pre_scene": "[They run after you. Though your crowded surroundings make obstacles for you.]"
            }
        ]
    },
    {
        "id": "2(2)",
        "msg": "[They no longer follow. But you can still feel their gaze on you for a little longer, before the gaze fades.]",
        "options": [
            {
                "option": "[Risk a glance back.]"
            },
            {
                "option": "[Keep walking. You're almost out.]"
            }
        ]
    },
    {
        "id": "2(2)2",
        "msg": 
        [
            "[You are out of the mall. Cars pass by on the road in front of you.]",
            "[You should be safe now.]"
        ],
        "options": [
            {
                "option": "[Keep walking.]",
                "jumpto": "01",
                "remember_id": true
            },
            {
                "option": "[...\"Roulx was in there.\"]"
            }
        ],
        "location": "mall_entrance"
    },
    {
        "id": "01",
        "msg": 
        [
            "Ending 1.  Strangers in the End.",
            "Roulx thinks that they'd simply mistaken them for kir dear friend. A pity."
        ],
        "options": [
            {
                "option": "Restart.",
                "jumpto": "0"
            },
            {
                "option": "Revert to previous move.",
                "jumpto": "remember_id"
            }
        ]
    },
    {
        "id": "03",
        "msg":
        [
            "Ending 3. It's snowing.",
            "Perhaps in a happier ending you'll bother to remember what you claim to have forgotten."
        ],
        "options": [
            {
                "option": "Restart.",
                "jumpto": "0"
            }
        ]
    },
    {
        "id": "2(2)22",
        "msg": 
        [
            "[Yes, this is true. Roulx, a former ally that you knew, is still in the mall. You have no idea what they are doing in there, nor how long they plan to stay.]",
            "",
            "[...]"
        ],
        "options": [
            {
                "option": "[Walk away. Try to forget.]",
                "jumpto": "01",
                "remember_id": true
            },
            {
                "option": "[Return to the mall.]",
                "voice_in_head": false
            }
        ]
    },
    {
        "id": "2(2)222",
        "msg": "[Great. Now what are you going to do?]",
        "options": [
            {
                "option": "[Walk up to them. Greet them like any normal person.]",
                "jumpto": "2(1)31",
                "feign_surprise": true
            },
            {
                "option": "[Observe their movements.]"
            }
        ],
        "location": "mall1"
    },
    {
        "id": "2(1)33(1)",
        "msg": "[After a while of running, you seem to have lost them. The streets run bare. The strange person is nowhere in your sense.]",
        "options": [
            {
                "option": "[Risk a glance back.]",
                "jumpto": [
                    "2(1)33(1)1(1)",
                    "2(1)33(1)1(2)"
                ],
                "chance": [
                    0.5,
                    0.5
                ]
            },
            {
                "option": "[Catch your breath.]",
                "jumpto": [
                    "2(1)33(1)1(1)",
                    "2(1)33(1)1(2)"
                ],
                "chance": [
                    0.5,
                    0.5
                ]
            },
            {
                "option": "[Keep running. Don't look back.]"
            }
        ],
        "location": "streets"
    },
    {
        "id": "2(1)33(1)1(1)",
        "msg": "[Guess what mfer. Out of the lone sounds of the city noise, you hear in haste. Running.]",
        "options": [
            {
                "option": "[Run.]"
            },
            {
                "option": "[Just give up already. You can't hide.]"
            }
        ]
    },
    {
        "id": "2(1)33(1)1(1)2",
        "msg": 
        [
            "[You come to a halt, huffing, aching in your lungs. You haven't run quite so much in a while... huh. You must be getting old.]",
            "[Sweat trickles down the side of your face as you hear the light footsteps catching up behind you.]",
            "[The footsteps slows down, right, behind you.]",
            "",
            "Roulx: \"What are you running for?\""
        ],
        "options": [
            {
                "option": "\"...   I don't want to talk to you.\""
            },
            {
                "option": "\"...Wait, Roulx? Oh, I..\" [huff,] \"I didn't realise it was you.\""
            }
        ]
    },
    {
        "id": "2(1)33(1)1(1)21",
        "msg": 
        [
            "Roulx: \"Why not...\"",
            "[They look sad, in the ever so kind of way that you can tell. Or is it disappointment?]",
            "",
            "\"...\""
        ],
        "options": [
            {
                "option": "\"Why, because I don't know you.\"",
                "jumpto": "2(1)33(1)1(1)22"
            },
            {
                "option": "\"There's nothing that I can tell you.\""
            }
        ]
    },
    {
        "id": "2(1)33(1)1(1)22",
        "msg": "Roulx: \"Olive. My- it's you, of course.\"",
        "options":
        [
            {
                "option": "Who's Olive?"
            },
            {
                "option": "I have nothing to tell you. I have nothing to tell you that I can be proud of. I am sorry."
            }
        ]
    },
    {
        "id": "2(1)33(1)1(1)221",
        "msg":
        [
            "Roulx: \"You're Olive! You're... You're.\"",
            "[They hesitate, moving their gaze away from you, looking downwards to the ground.]",
            "",
            "[You stare them back, regardless of their gaze towards you. Your eyes are as dead as your soul.]"
        ],
        "options":
        [
            {
                "option": "I don't know them."
            }
        ]
    },
    {
        "id": "2(1)33(1)1(1)222",
        "msg":
        [
            "Roulx: \"I'm... Right.\"",
            "",
            "[Ki fiddles with their hands, fingertips intersecting each other like polygons that were poorly joined.]",
            "Roulx: \"I mean, it's okay, we can. We can restart from the beginning? You're here, I'm, here as well.\"",
            "[Who cares what lead to the end the years ago, Roulx doesn't.]",
            "[Ki smiles taut and pulled outwards for you, outstretched hands shaking before you noticed and they retracted behind kimself.]",
            "",
            "",
            "[You say nothing, looking down at your shoes and the concrete.]",
            "[Olive doesn't know how to smile anymore. Autumn does, but Olive doesn't.]"
        ],
        "options":
        [
            {
                "option": "What is there to restart?"
            }
        ]
    },
    {
        "id": "2(1)33(1)1(1)1",
        "msg": "[Are you sure you're gonna keep on running? Buddy. Do you even know who you're running up against?... Well, you take off again. But they sound like they're catching up. Are you seriously gonna?]",
        "options": [
            {
                "option": "[Give. Up.]",
                "jumpto": "2(1)33(1)1(1)2"
            },
            {
                "option": "[Keep. Running.]"
            }
        ]
    },
    {
        "id": "2(1)33(1)1(1)12",
        "msg": "[... It's behind you. It's behind you. It's behind you. It's.]",
        "options": [
            {
                "option": "[Run.]"
            },
            {
                "option": "[Freeze.]",
                "jumpto": "2(1)33(1)1(1)2"
            }
        ]
    },
    {
        "id": "2(1)33(1)1(1)121",
        "msg": 
        [
            "Roulx: \"hmph-\"",
            "",
            "[Something, *someone* fell. The footsteps have stopped.]"
        ],
        "options": [
            {
                "option": "[Run.]",
                "jumpto": "02"
            },
            {
                "option": "[Turn.]"
            }
        ]
    },
    {
        "id": "02",
        "msg": 
        [
            "Roulx: \"...\"",
            "",
            "[You keep on running. There's nothing making indication of them still chasing you.]"
        ],
        "options": [
            {
                "option": "[Run.]"
            }
        ]
    },
    {
        "id": "021",
        "msg": "",
        "options": [
            {
                "option": "[Run.]"
            }
        ]
    },
    {
        "id": "0211",
        "msg": "",
        "options": [
            {
                "option": "[Run.]"
            }
        ]
    },
    {
        "id": "02111",
        "msg": "",
        "options": [
            {
                "option": "[Run.]"
            }
        ]
    },
    {
        "id": "021111",
        "msg":
        [
            "[Pant, pant, pant..]",
            "",
            "",
            "['...  You can't... You can't keep doing this to yourself, Olive. ...']"
        ],
        "options": [
            {
                "option": "[\"Who's Olive?\"]",
                "jumpto": "#",
                "prescene": "Ending 2."
            }
        ]
    },
    {
        "id": "2(1)33(1)1(2)",
        "msg": 
        [
            "[You seemed to have lost them... You find yourself upon the sidewalks of a street you don't recognise. Red brick walls censored with graffiti, cig buds lay trash to the exposed roots of trees.]",
            "[Well damn how are you gonna get back now?...]"
        ],
        "options": [
            {
                "option": "[Find current location on phone.]"
            },
            {
                "option": "[Try to retrace steps back to the mall.]",
                "jumpto": [
                    "2(1)33(1)1(2)2",
                    "2(1)33(1)1(2)11"
                    ],
                "chance": [
                    0.66666666666,
                    0.33333333333
                ]
            }
        ]
    },
    {
        "id": "2(1)33(1)1(2)1",
        "msg": 
        [
            "[You open your map in search of your current location. You have, in miracle, ran as fast as you can all the way to further west of your suburb. Despite at least going out from time to time, you hadn't ever came around this far in this direction. Perhaps it's because of the lack of street lights around here, or the simply fewer people that'd even talked about.]",
            "",
            "[... Luckily it's only a few minutes walk to get back to where you are more familiar. As you know where you are going.]"
        ],
        "options": [
            {
                "option": "[Retrace steps back to the mall.]"
            }
        ],
        "lost": false
    },
    {
        "id": "2(1)33(1)1(2)11",
        "msg": 
        [
            "[Through a bit of trouble (and a bit of disorientation. bro where did you ev), you have retraced your steps.]",
            "",
            "[You stand in front of the mall's still open glass doors. Bright afternoon sun, shines warm tracing your back. The mall is placed at a very nice position in the suburb, good potential, good flow of people. There's even two bus stops near by.]"
        ],
        "options": [
            {
                "option": "[Leave on the closest bus. Try to forget who you saw.]",
                "jumpto": "01",
                "remember_id": true,
                "bus": null
            },
            {
                "option": "...Roulx is still here somewhere.",
                "bus": null
            }
        ],
        "location": "mall_entrance",
        "time_passage": true
    },
    {
        "id": "2(1)33(1)1(2)112",
        "msg": 
        [
            "[Oh yes they are.]",
            "[But,, are you sure you'll be able to find them? Even if you've been here so many times..]",
            "",
            "[It had taken you a bit of time to get back here.]",
            "[Don't you think that they would've left by now?]"
        ],
        "options": [
            {
                "option": "[Give up. Leave.]",
                "jumpto": "01",
                "remember_id": true
            },
            {
                "option": "[Poke around a bit.]"
            },
            {
                "option": "[...Open the group chat.]",
                "jumpto": "4",
                "remember_id": true
            }
        ]
    },
    {
        "id": "2(1)33(1)1(2)1122",
        "msg": "[Sure. Where do you poke around?]",
        "options": [
            {
                "option": "[Scan the bus stops for kir presence.]"
            },
            {
                "option": "[Look for kime in the mall.]",
                "jumpto": "2(2)222"
            }
        ]
    },
    {
        "id": "2(1)33(1)1(2)11221",
        "msg": "[Well, here is a bus stop. You seriously sure you're looking around *here* for them? You don't even know if they know how to use buses! And besides this bus stop, there's this like, one other scrawny old lady waiting and a bird up there on the hanging wires.]",
        "options": [
            {
                "option": "[Ask the nice lady whether they've seen an individual with white hair and a white suit, a tote bag, and a... yay-high height (like, 10cm taller than him).]"
            },
            {
                "option": "[\"Eh.. Either they've already left or they're in the mall.\"]",
                "jumpto": "2(2)222"
            }
        ],
        "location": "bus_stop"
    },
    {
        "id": "2(1)33(1)1(1)1212",
        "msg": "[Upon your vision, your dear friend falls collapsed on the cement. Not from being tripped, no, they're better than that.]",
        "options": [
            {
                "option": "[Wait for a sign of movement.]"
            },
            {
                "option": "[Run away.]",
                "jumpto": "02"
            },
            {
                "option": "...I'm. Sorry. ..."
            }
        ],
        "chased": true
    },
    {
        "id": "2(1)33(1)1(1)12121",
        "msg": 
        [
            "[There are twitches in their shoulder. White hair splayed on the ground, they do eventually make to slowly sit up.]",
            "[They simply...]",
            "[Look at you.]",
            "[You can't tell their expression. Is it confusion? Is it coldness? Is it frustration?]"
        ],
        "options": [
            {
                "option": "[Hold your silence.]"
            },
            {
                "option": "[Offer a hand.]"
            },
            {
                "option": "\"...I'm. So sorry. ...\""
            }
        ]
    },
    {
        "id": "2(1)33(1)1(1)121212",
        "msg": "[Their response is slow. Their own hand, though gloved, reaches up to take yours.]",
        "options": [
            {
                "option": "\"Are you hurt?\""
            },
            {
                "option": "\"Sorry I ran away. I didn't recognise you.\""
            },
            {
                "option": "\"...\""
            }
        ]
    },
    {
        "id": "2(1)33(1)1(1)1212121",
        "msg": 
        [
            "[You help them up.]",
            "Roulx: \"I'm alright.\"",
            "[They take a stance in front of you. Slower breaths.]",
            "Roulx: \"Are you,, are you alright?\""
        ],
        "options": [
            {
                "option": "\"Yes. I'm alright.\""
            }
        ]
    },
    {
        "id": "2(1)33(1)1(1)12121211",
        "msg": 
        [
            "[They breathe. Inhale, exhale. But then take themself to gain poise.]",
            "Roulx: \"How have you been, Olive?\""
        ],
        "options": [
            {
                "option": "\"...Who's Olive?\""
            }
        ]
    },
    {
        "id": "2(1)33(1)1(1)1212122",
        "msg": 
        [
            "[You help them up.]",
            "Roulx: \"That,, that's alright.\"",
            "[They look away to the side.]",
            "Roulx: \"What... How have you been, Olive?\""
        ],
        "options": [
            {
                "option": "\"...Who's Olive?\""
            }
        ]
    },
    {
        "id": "2(1)33(2)",
        "msg": "[The doors of the mall closes behind you,, seconds later than you would imagine. Hmm. That's odd.]",
        "options": [
            {
                "option": "[Run.]",
                "jumpto": "2(1)33(1)"
            },
            {
                "option": "[Turn around.]",
                "jumpto": "2(1)2"
            },
            {
                "option": "\"...Hello, Roulx.\"",
                "jumpto": "2(1)13"
            }
        ],
        "location": "mall_entrance"
    },
    {
        "id": "2(1)33(3)",
        "msg": "[...You feel someone tapping on your shoulder in your half stumbling stroll. Who might that be?]",
        "options": [
            {
                "option": "[Freeze.]",
                "jumpto": "2(1)1"
            },
            {
                "option": "\"...Hello, Roulx.\"",
                "jumpto": "2(1)13"
            }
        ]
    },
    {
        "id": "2(2)2222",
        "msg": "[Roulx is only a block away from its original spot. Now having lost its original target, it is staring over metal railings to the floor below...]",
        "options": [
            {
                "option": "[Sneak around on the same floor.]"
            },
            {
                "option": "[Go up the escalator to observe them from above.]",
                "jumpto": "2(2)22221",
                "location": "mall2"
            }
        ]
    },
    {
        "id": "2(2)22221",
        "msg": 
        [
            "[The shadows of the layer above you, masked by overhead lights, casting a warm glow over the tiled floorings. Dark metallic steel door frames, make contrast with the glass and signage of the other storefronts around, by their signage made of metal. They're right there. You can't see them. But. *They're there*.]",
            "",
            "[Roulx has moved from their previous position, but as you peer around for even the tint of white, you spot them. They've gone strolling down the corridor, gazing pensively over the glass fronts of luxury items.]"
        ],
        "options": [
            {
                "option": "[\"I wonder what they are buying.\"]"
            },
            {
                "option": "[\"I wonder why they're spending so luxuriously.\"]",
                "jumpto": "2(2)222211"
            }
        ]
    },
    {
        "id": "2(2)222211",
        "msg":
        [
            "[How curious.. What do they have... Clothes, jewels, tools...]",
            "[As you inspect the items abound, you don't forget who *you* are looking out for. Roulx has found their way into a tools repair workshop.]"
        ],
        "options": [
            {
                "option": "[Idly wonder what they are buying.]",
                "pop": [
                    "[You ponder what they might be buying, staying in spot. Roulx is inside the tools repair workshop.]",
                    "[Roulx... Usually utilises tools that are more ordinary for their work. It's rather peculiar to see them ponder items that,, by what you know, seldom in their standard.]"
                    ]
            },
            {
                "option": "[Creep back downstairs.]",
                "location": "mall1",
                "pop": [
                    "[You creep back downstairs.]", "",
                    "[The shadows of the layer above you, masked by overhead lights, casting a warm glow over the tiled floorings. Dark metallic steel door frames, make contrast with the glass and signage of the other storefronts around, by their signage made of metal. They're right there. You can't see them. But. *They're there*.]"
                    ],
                "flagged": true
            },
            {
                "option": "[Crane your head over the railing to get a better look.]",
                "jumpto": "2(2)2222112",
                "flagged": true
            }
        ]
    },
    {
        "id": "2(2)2222112",
        "msg":
        [
            "[Their bright figure is distinctive in the scarcely visited workshop. Peering, they take only short glances of the complicated parts and charts and diagrams on the walls.]",
            "[But an item they take out of their decorated tote bag catches your attention. A gloved hand, holding up a small, grey, staff-like item, conducting quiet chatter with the facilitator from the desk - which you cannot tell what they're talking about from your position, as their back is turned towards you.]"
        ],
        "options": [
            {
                "option": "[Wait around.]",
                "jumpto": [
                    "2(2)22221121(1)",
                    "2(2)22221121(2)"
                ],
                "chance": [
                    0.5,
                    0.5
                ]
            },
            {
                "option": "[Listen in on their conversation.]",
                "alter_next": 0,
                "chance": [
                    0.2, 0.2, 0.2, 0.2, 0.2
                ]
            }
        ]
    },
    {
        "id": "2(2)22221122",
        "msg": 
        [
            "[Start of dialogue section:]",
            "",
            "\"Could you please disassemble this item for me?\"",
            "\"Sure. May I ask what this thing is?\"",
            "\"It's a device. But we just need some of its components.\"",
            "\"And where might have you gotten it?\"",
            "\"[A noticeable pause.]\"",
            "\"I don't know.\"",
            "\"That's alright. You can leave it here and if you could leave your contact information, we'll have it done in latest tomorrow.\"",
            "",
            "[End of dialogue.]"
        ],
        "options": [
            {
                "option": "[\"...I'm curious.\"]"
            },
            {
                "option": "[\"This is literally none of my business.\"]",
                "jumpto": "2(2)222211221"
            }
        ]
    },
    {
        "id": "2(2)222211221",
        "msg": "[😒]",
        "options": [
            {
                "option": "[Wait around.]",
                "jumpto": [
                    "2(2)22221121(1)",
                    "2(2)22221121(2)"
                ],
                "chance": [
                    0.5,
                    0.5
                ]
            },
            {
                "option": "[JUST GO TALK TO THEM GODDAMMIT]",
                "jumpto": "2(1)31",
                "feign_surprise": true
            }
        ]
    },
    {
        "id": "2(2)22221121(1)",
        "msg": 
        [
            "[You wait around on the spot.]",
            "[Roulx comes out of the store, noticing you creeping around the storefront... They look towards you, saying nothing but just a strange look.]"
        ],
        "options": [
            {
                "option": "[Pretend you hadn't noticed. Walk off again.]"
            },
            {
                "option": "[Frown at them, like it's weird that they're staring. They're strangers after all.]"
            },
            {
                "option": "[Give in.]",
                "jumpto": "2(1)31",
                "feign_surprise": true
            }
        ]
    },
    {
        "id": "2(2)22221121(2)",
        "msg": 
        [
            "[You wait around on the spot.]",
            "[Roulx comes out of the store. Luckily, they turn the other way, strolling past your sneaky behaviour.]"
        ],
        "options": [
            {
                "option": "[Watch Roulx.]",
                "jumpto": "2(2)22221121(2)1"
            }
        ]
    },
    {
        "id": "2(2)22221121(1)1",
        "msg": 
        [
            "[You spin around before they get the chance to make eye contact with you. Tucking your hands in pockets and sucking in a quick breath, you walk off. The way that you turn, almost reminds one of a video game NPC.]",
            "[But they don't move. Completely silent the moment that they've spotted you. That when you turn away, you can tell from the net zero audio cue, that they have hadn't taken any steps away at all.]"
        ],
        "options": [
            {
                "option": ""
            }
        ]
    },
    {
        "id": "2(2)22221121(1)2",
        "msg": 
        [
            "[You frown at Roulx.]",
            "[They seem put off by that expression, tilting their head at you.]",
            "Roulx: \"Hmm? My apologies.\"",
            "[They turn, moving out of your way to the other side of the walkway. Presumably giving *you* space, as any polite stranger would.]"
        ],
        "options": [
            {
                "option": "[Buy something. Anything.]"
            },
            {
                "option": "[Watch Roulx.]",
                "jumpto": "2(2)22221121(2)1"
            }
        ]
    },
    {
        "id": "2(2)22221121(1)21",
        "msg": 
        [
            "[You begin to look for something to buy. Perhaps to make yourself look less suspicious.]",
            "",
            "[However. The area that you are in doesn't serve the cheapest... Well, to the least there is a food court near the same entrance that you came from, but that's a few walls of distance as well.]"
        ],
        "options": [
            {
                "option": "[Just browse, then.]",
                "pop": "\"...\""
            },
            {
                "option": "[Watch Roulx.]",
                "jumpto": "2(2)22221121(2)1"
            }
        ]
    },
    {
        "id": "2(2)22221121(2)1",
        "msg": 
        [
            "[... You come to the sense, to watch. Roulx.]",
            "",
            "[You turn around to them away. How they move as quiet as you remembered with coldness. But they haven't left your sight. Or to say, you haven't allowed them to leave your sight.]"
        ],
        "options": [
            {
                "option": "[Follow them. You can't afford to lose them.]"
            }
        ]
    },
    {
        "id": "2(1)31",
        "msg": 
        [
            "\"Oh. ...Wait, Roulx? Is that you?\"",
            "Roulx: \"Yes? Olive, it's me.\"",
            "[The two their hands point to themself, leaning forward in a,, almost pleading gesture?]",
            "",
            "\"Heh... Sorry, I just didn't realise it was you! Well we,, we haven't seen each other in a while, have we?\"",
            "\"...Wait.\""
        ],
        "options": [
            {
                "option": "\"Who's Olive?\""
            }
        ],
        "location": "mall1"
    },
    {
        "id": "2(1)311",
        "msg": 
        [
            "Roulx: \"Hmm? You're Olive. Right?\"",
            "[They tilt their head, a gesture of confusion. A right hand which taps less patient than their tone may tell.]"
        ],
        "options": [
            {
                "option": "\"...Huh? I'm not Olive. I'm Autumn. Autumn Sky. You must have confused me for someone else.\""
            }
        ]
    },
    {
        "id": "2(1)3111",
        "msg": 
        [
            "[Their expression drops, even if there weren't much except for the way they stared at you.]",
            "",
            "Roulx: \"O-Oh. ...\"",
            "[They fidget, eyes darting away to the ground beside and their hand fiddling with tote bag straps on their shoulder.]",
            "Roulx: \"Ah... My apologies. I.. Must've mistaken you for a friend of mine.",
            "",
            "[Friend.]"
        ],
        "options": [
            {
                "option": "\"That's alright. Mistakes happen all the time.\"",
                "jumpto": "3111"
            }
        ]
    },
    {
        "id": "2(1)1",
        "msg": 
        [
            "[You go very, very still. As though that will help you now, Heh.]",
            "[How silly of you!. Well they simply stare down at you, huffing, but slowing breaths noticeable as they stand right in front of you.]",
            "",
            "Roulx: \"...\"",
            "[It stares.]"
        ],
        "options": [
            {
                "option": "[Stare back.]"
            },
            {
                "option": "\"...Roulx?\"",
                "jumpto": "2(1)31"
            },
            {
                "option": "\"...Hello, Roulx.\"",
                "jumpto": "2(1)13"
            }
        ]
    },
    {
        "id": "2(1)13",
        "msg": 
        [
            "[They take a step back, surprised.]",
            "Roulx: \"Ol-Olive?\"",
            "",
            "\"...  ...  ........\""
        ],
        "options": [
            {
                "option": "Who's Olive?"
            }
        ]
    },
    {
        "id": "2(1)131",
        "msg": 
        [
            "[There is a pause in their movement, as they pull a gap between the gaps of their fingers, in a peeking and examining kind of way.]",
            "",
            "Roulx: \"?... But you?\"",
            "",
            "[They pull both their hands off their face, a hand nudging their totebag over their shoulder again. Their head tilted a curious way. Would be an innocent gaze of obliviousness if you didn't know.]"
        ],
        "options": [
            {
                "option": "\"I'm Autumn. Autumn Sky. You must have confused me for someone else.\""
            }
        ]
    },
    {
        "id": "2(1)1311",
        "msg": 
        [
            "Roulx: \"Huh... Haven't, then I've mistaken you for someone else.. My apologies.\"",
            "[How cruel? But they smile at you.]"
        ],
        "options": [
            {
                "option": "\"That's alright. Mistakes happen all the time.\"",
                "jumpto": "3111"
            }
        ]
    },
    {
        "id": "2(1)11",
        "msg": 
        [
            "[Oh a staring contest?...]",
            "",
            "[...]",
            "[...]",
            "[...]",
            "[...]",
            "[...]",
            "",
            "[Their face scrunches up uncomfortably.]"
        ],
        "options": [
            {
                "option": "[You're on.]"
            },
            {
                "option": "\"...Roulx?\"",
                "jumpto": "2(1)31"
            },
            {
                "option": "\"...Hello, Roulx.\"",
                "jumpto": "2(1)13"
            }
        ]
    },
    {
        "id": "2(1)111",
        "msg": 
        [
            "[Oh so it's on.]",
            "",
            "[You raise your head ever so slightly to match up. Staring. Glaring.]",
            "[...]",
            "",
            "[... Yeah no, they're physically leaning backwards. In the way they seem to be squinting.]",
            "[Oop- You won. Roulx'd looked away, taking a step backwards. And a two hands covering their face and eyes.]"
        ],
        "options": [
            {
                "option": "\"...Roulx?\"",
                "jumpto": "2(1)31"
            },
            {
                "option": "\"...Hello, Roulx.\"",
                "jumpto": "2(1)13"
            }
        ]
    },
    {
        "id": "3111321222",
        "msg": 
        [
            "Roulx: \"Oh! Uhm, he's. Uh. Very... I'm rather fond of him.\"",
            "[It looks around curiously, stopping at a centre on the table between them. An index finger circles the spot playfully.]",
            "",
            "Roulx: \"You should've. He can be rather tactical as well, so... You, uhm, you two might've gotten along as well.  Where back in the days, when you were scheming and... Well. Yeah. If you don't want to talk about that, it's all good with me.\""
        ],
        "options": [
            {
                "option": "\"I'd... rather not talk about it, yes. Thank you.\"",
                "chased_option": null
            },
            {
                "option": "\"..What schemes?\"",
                "pre_scene":
                [
                    "Roulx \"Oh.\"",
                    "[Roulx leans back on its seat. Looking around the space again, but this time seeming to be more observing than evading your gaze.]"
                ],
                "jumpto": [
                    "3111321222(1)",
                    "3111321222(2)"
                ],
                "chance": "coin"
            }
        ]
    },
    {
        "id": "3111321222(1)",
        "msg":
        [
            "Roulx: \"... It's been a while hasn't it. Perhaps it's good that you've already forgotten.\"",
            "[They smile at you, but why does it seem ever so saturnine.]"
        ],
        "options":
        [
            {
                "option": "\"... Yeah.\""
            },
            {
                "option": "\"Where were we? Yes, Hugo.\""
            }
        ]
    },
    {
        "id": "3111321222(1)2",
        "msg":
        [
            "[It nods back, gently somehow, saccharine in a way you can't quite pin down.]", 
            "Roulx: \"Hugo! Yes, yeah. We've been, around. Yes.",
            "[Not one to stutter a lot, either to stay silent, or only speak when needed to.]",
            "",
            "[You recall them. A difference. Ah., Ki's changed.]"
        ],
        "options":
        [
            {
                "option": ""
            }
        ]
    },
    {
        "id": "3111321222(2)",
        "msg":
        [
            "Roulx: \"... It's been too long hasn't it?. You, gathering the valiant group of people. A rebellion it was.\"",
            "Roulx: \"Like a dream even.\"",
            "",
            "Roulx: \"Do you remember?\""
        ],
        "options":[
            {
                "option": "\"Yes. Like a dream.\""
            },
            {
                "option": "\"..I don't remember as much as I'd like, to be honest. What were we talking about again?\""
            }
        ]
    },
    {
        "id": "3111321222(2)1",
        "msg":
        [
            "Roulx: \"Like a dream huh?\"",
            "[Its chin rests on the back of its hand, looking down aside for a moment.]",
            "[They do look back.]",
            "Roulx: \"Don't worry, it's that way for me too.\"",
            "",
            "[Roulx dreams often. For some reason, you remember that about it.]"
        ],
        "options":[
            {
                "option": "\"Have any nice dreams lately?\""
            },
            {
                "option": "\"What else were we talking about?\""
            }
        ]
    },
    {
        "id": "3111321221",
        "msg":
        [
            "Roulx: \"He is good to me! I can't really go a day without seeing him, so he's nearly always there for me.\"", 
            "[Roulx cups kir face in kir hands, pair of eyes playfully glancing around kir surroundings in an embarrassed way to avoid eye contact.]",
            "Roulx: \"Charismatic... That is certainly a way to describe him.\""
        ],
        "options": [
            {
                "option": ""
            }
        ]
    },
    {
        "id": "3111321223",
        "msg":
        [
            "Roulx \"Yeah! We're actually here too for a business discussion.\"",
            "[Roulx smiles with no teeth, a hand coming to slowly tap on the surface of the table.]",
            "Roulx: \"As to what it is... Well, it's confidential. But I'm sure you can imagine!\""
        ],
        "options": [
            {
                "option": ""
            }
        ]
    },
    {
        "id": "2(2)22221121(2)11",
        "msg": 
        [
            "[... You are following them. Again.]",
            "",
            "[May the vibrant lights of the windows follow you through, light up your paths and leave not a trace of yours. But watch theirs.]",
            "[They turn, again, again. Surely they could've taken a shorter route, but they don't look back, turning into an obscure room after heading into an emergency exit. There is a sign on the door, \"Janitor Clocker\"... A loose compound of a closet, and a locker.]"
        ],
        "options":[
            {
                "option": "[Hide near the entrance and see if they come back out.]"
            },
            {
                "option": "[Follow them in.]",
                "location": "mall_office",
                "jumpto": "5"
            }
        ],
        "location": "clocker"
    },
    {
        "id": "5",
        "msg":
        [
            "[... Wh. How. Where.]",
            "",
            "[This is not a Janitor Clocket. Clocker. Whatever you kids call them these days. This is an office building. Matt-blurred walls made of glass, behind them there are darkened figures burlling away at desks. The barely visible similarly glass doors, decorated mindlessly with metal nameplates.]",
            "",
            "[What... What is Roulx doing here? Why is there a this here?]"
        ],
        "options":[
            {
                "option": "['...Enlite?']",
                "enlite_oblivion": false
            },
            {
                "option": "[\"A finance office for regulating the mall behind the scenes?\"]",
                "enlite_oblivion": true,
                "jumpto": "51"
            }
        ]
    },
    {
        "id": "51",
        "msg": "[This looks just like any other cookie cutter rent out business building. At least on the inside. You can't be sure of anything, except there is no Enlite's logo, not anywhere you can see yet.]",
        "options":[
            {
                "option": "[Hide.]"
            },
            {
                "option": "[Look for Roulx.]"
            },
            {
                "option": "[Ask someone politely where this is.]"
            }
        ]
    },
    {
        "id": "512",
        "msg":
        [
            "[Hmm. You're efficient at this. In fact, you can still hear Roulx's footsteps.]",
            "[You follow them. You can't help but notice how quiet it is despite their footsteps filling up the space.]"
        ],
        "options":[
            {
                "option": "[Become very conscious of your own footsteps.]"
            },
            {
                "option": "[Look towards where they are headed.]"
            }
        ]
    },
    {
        "id": "5122",
        "msg":
        [
            "[The room is almost walled with rooms. Floor tiled with dark granite flooring. They turn at points where it seems like a dead-end, the walls also layered a modern, minimalistic dark,, material. Tables set against the walls seem almost casual with printers and other devices that beep when you get too close.]",
            "",
            "[Something tells you that you should not be here.]",
            "",
            "[But Roulx has already turned again, opening the glass door and walking into a room.]"
        ],
        "options": [
            {
                "option": "[Peer through the door.]"
            },
            {
                "option": "[Follow Roulx in.]"
            },
            {
                "option": "[Ask someone politely where this is.]"
            }
        ]
    },
    {
        "id": "2(1)33(1)1(2)2",
        "msg":
        [
            "[Ohhh you do nottt recognise your surroundings. Is this really how you went though, sprinting in haste?]",
            "",
            "[You've been walking for ten minutes. The way the houses align each others' fences, seems still unfamiliar.]"
        ],
        "options":
        [
            {
                "option": "[Check your phone for the location.]",
                "jumpto": "2(1)33(1)1(2)1"
            },
            {
                "option": "[Keep going, you've got this.]",
                "jumpto": [
                    "2(1)33(1)1(2)2(1)",
                    "2(1)33(1)1(2)2(2)"
                    ],
                "chance": "coin"
            }
        ]
    },
    {
        "id": "2(1)33(1)1(2)2(1)",
        "msg": [
            "[There's nowhere better to be lost at huh! You'd know it's purely luck that'd gotten you to an actual bus stop, and looking at the time table, it seems the next one should be coming in about 7 minutes. But you know by experience that buses around here are never quite on time, either a bit too early or much too late.]",
            "[Besides that, there's no one else around. There's a bird sat up there on the hanging wires.]"
        ],
        "options":[
            {
                "option": "[Listen to an audiobook or something while you're waiting.]"
            },
            {
                "option": "[Observe the snow.]"
            }
        ],
        "location": "bus_stop"
    },
    {
        "id": "2(1)33(1)1(2)2(1)1",
        "msg":
        [
            "[You get up an audiobook to listen to, pulling out half tangled wired earbuds from your pockets. You shiver a little. The narrator's voice rings through your earbuds as you wait.]"
        ],
        "options":[
            {
                "option": ""
            },
            {
                "option": "",
                "jumpto": "2(1)33(1)1(2)2(1)11"
            }
        ]
    },
    {
        "id": "2(1)33(1)1(2)2(1)2",
        "msg": [
            "[It's cold outside. It's no wonder, as the grassy lawns of those behind you are covered in a visible layer of white. Blinding, like patches of unrendered webpages.]",
            "",
            "[They remind you of Roulx.]",
            "[The way that totality of whiteness, stands out from every other earth tones around it.]",
            "[And the way it's still. Not unmoving, but unnoticeable, until you made the effort to look...]",
            "[Nothing was gained from learning that.]"
        ],
        "options": [
            {
                "option": "[Nothing was gained.]"
            }
        ],
        "snow": true
    },
    {
        "id": "2(1)33(1)1(2)2(1)21",
        "msg": "[It's not your intention. You begin to notice snow everywhere. On the streets, on the shoulders of a person walking by, on the leaves of trees. None on the bus that's arriving though. Your ears turn red from the coldness, cold to your palms as you cover them for some reason.]",
        "options": [
            {
                "option": "[Get on the bus.]",
                "jumpto": "2(1)33(1)1(2)2(1)11"
            }
        ],
        "snow": true
    },
    {
        "id": "2(1)33(1)1(2)2(1)11",
        "msg": "[You ride the bus. The sounds of the outside are muffled, the bus rocks back and forth along the road to...]",
        "options":[
            {
                "option": "[... Home. You're going home.]",
                "jumpto": "01",
                "remember_id": true
            },
            {
                "option": "[... to the mall.]",
                "jumpto": "2(1)33(1)1(2)11",
                "bus": "mall",
                "voice_in_head": false
            }
        ]
    },
    {
        "id": "031",
        "msg": "[Home? Are you really going to go home? After all of that, even after you remembered it?]",
        "options":[
            {
                "option": "['...']",
                "jumpto": "remember_id",
                "voice_in_head": true
            },
            {
                "option": "[\"Nonsense. I'd already forgotten.\"]"
            }
        ]
    },
    {
        "id": "0312",
        "msg": [
            "[You arrive home. Hands tucked into your pockets unlike always. But maybe just like always, it's because you're",
            "",
            "",
            "",
            "[cold. Who were you talking to?]"
        ],
        "options": [
            {
                "option": "[No one. no one no one no one no one no one no one no one no one no one no one no one no one no one no one no one no one no one no one no one no one]",
                "jumpto": "03"
            },
            {
                "option": "[It's so cold.]",
                "jumpto": "03"
            }
        ],
        "location": "doesnt_feel_like_home"
    },
    {
        "id": "2(1)33(1)1(2)2(2)",
        "msg": "[Is this guy just... Lost at this point? Wha? The houses and an occasional park remains the usual sighting in your fore going tracks.]",
        "options":[
            {
                "option": "['...Wait. I recognise this place.']",
                "enlite_oblivion": false
            },
            {
                "option": "[\"...Completedly foreign area. Huh.\"]",
                "jumpto": "2(1)33(1)1(2)2(2)1",
                "enlite_oblivion": true
            }
        ]
    },
    {
        "id": "2(1)33(1)1(2)2(2)1",
        "msg": 
        [
            "[Obviously. You used to work there dumbass.]",
            "[Some ways ahead, across the wide, busy street, stands the recognisable sliding doors into Enlite's Sydney headquarters. The pavement of the sidewalk transforms into a series of furbished grey tiles at its entrance, letting people into its quiet maw.]"
        ],
        "options": [
            {
                "option": "[Enter the building.]"
            },
            {
                "option": "['what the fuck do you think you're doing']",
                "jumpto": "2(1)33(1)1(2)2(2)11"
            }
        ]
    },
    {
        "id": "2(1)33(1)1(2)2(2)11",
        "msg": 
        [
            "[Surely you'd come back here for something normal right?]",
            "",
            "[There's of course things that you know are normaller to be, other than the brand itself and the iconic brand highlighter green stretched decoratively across wherever the exterior decorators knew.]",
            "[The inside is slightly more furbished. You don't wish to know what they've done to this place over the time that you were gone. Though worthy of note, there is a medicine store down to your left. Other places as well. But your gut wrenches at the recollection they bring.]"
        ],
        "options":[
            {
                "option": "[Buy some painkillers.]"
            },
            {
                "option": "['No. What the fuck. Leave. Before someone recognises you.']"
            }
        ],
        "location": "enlite_headquarters"
    },
    {
        "id": "2(1)33(1)1(2)2(2)112",
        "msg":[
            "[Yeah! Like what if someone you haven't seen in nearly half a dozen years recognise your colours? Your clean, bloodless hands and lord forbid, your scarred face?!]",
            "[... What if the AIs recognise you?]",
            "",
            "[Oh please. As if they're actually going to do anything to you, as if you would even matter in their mechanical eyes now, come on now, walk.]"
        ],
        "options": [
            {
                "option": "[Buy some painkillers for yourself.]",
                "jumpto": "2(1)33(1)1(2)2(2)111"
            }
        ]
    },
    {
        "id": "2(1)33(1)1(2)2(2)111",
        "msg": 
        [
            "[You walk into the shop, remembering finally to buy some painkillers for yourself. Having been on your list of things to buy for quite some time now.]",
            "[The right kind of chemicals, the right kind of dosage, the right kind of gender and age group...]",
            "[Who cares, the last two doesn't even matter when buying painkillers. You still pick up a pack that matches closer with your own criterions. Afterall, who *actually knows* what they put in there besides that it works and it's cheap.]"
        ],
        "options": [
            {
                "option": "['Well doesn't this pill look familiar.']",
                "enlite_oblivion": false
            },
            {
                "option": "[\"I've never seen a tablet like this before in my life.\"]",
                "jumpto": "2(1)33(1)1(2)2(2)1111",
                "enlite_oblivion": true
            }
        ],
        "painkillers": 1
    },
    {
        "id": "2(1)33(1)1(2)2(2)1111",
        "msg": 
        [
            "[Of course not! It's the newest one out, and you haven't been catching up with Enlite's newest products quite yet. You're too healthy to be their target audience I'd say.]",
            "",
            "[Don't forget to buy some for Roulx as well.]"
        ],
        "options": [
            {
                "option": "[Buy a pack for Roulx.]"
            },
            {
                "option": "['FOR WHOM??????']",
                "jumpto": "2(1)33(1)1(2)2(2)11111"
            }
        ]
    },
    {
        "id": "2(1)33(1)1(2)2(2)11111",
        "msg": "[You purchase a box of painkillers for Roulx as well.]",
        "options": [
            {
                "option": "[Go find a bus stop. There should be a bus stop nearby.]",
                "lost": false,
                "jumpto": "2(1)33(1)1(2)2(1)"
            }
        ],
        "painkillers": 2
    },
    {
        "id": "4",
        "msg":
        [
            "-----------------------",
            "b Hey, is anyone at the shopping centre near palm street right now? Just wondering.",
            "w yeah, are you there too?",
            "b Yes, I'm nearby actually.",
            "b I'm looking for someone. I saw a glimpse of them before but it seems that I've lost them. So I think it should still be somewhere around but I can't seem to find it.",
            "w huh okay",
            "w friend of yours?"
        ],
        "options":[
            {
                "option": "Something like that, yeah."
            },
            {
                "option": "Not exactly."
            }
        ],
        "groupchat": "true"
    },
    {
        "id": "41",
        "msg":
        [
            "b Something like that, yeah.",
            "y Can't you just message them then?",
            "b I can't, unfortunately. I think ki's changed kir contact number, haven't been able to connect.",
            "b I haven't seen them in a while, you see",
            "w awkward situation"
        ],
        "options": [
            {
                "option":"[Scroll.]"
            }
        ],
        "friend": true
    },
    {
        "id": "42",
        "msg": 
        [
            "b Not exactly. I knew kime a while back though.",
            "b So acquaintances, more like.",
            "w i see."
        ],
        "options": [
            {
                "option": "[Scroll.]",
                "jumpto": "411"
            }
        ]
    },
    {
        "id": "411",
        "msg":
        [
            "w welp i hope you find them then.",
            "b Thx",
            "b I'm pretty sure ki was wearing a white suit and yellow bow tie last I saw kime. White hair, good fashion sense.",
            "b Could you keep an eye out for someone like that?",
            "w sure",
            "w i'm trying to find clay supplies on the art shop on the second floor, i'll let you know if i see anyone like that.",
            "b Thank you Drew, really appreciate it.",
            "w np"
        ],
        "options": [
            {
                "option": "[Scroll.]"
            }
        ]
    },
    {
        "id": "4111",
        "msg": "r Isn't that like stalking?",
        "options":[
            {
                "option": "No it's not."
            },
            {
                "option": "[Wait for someone else to respond.]"
            }
        ]
    },
    {
        "id": "41111",
        "msg":[
            "b I don't think so.",
            "b I mean I'm just trying to reconnect with someone I used to know.",
            "b I don't think that's too unreasonable."
        ],
        "options": [
            {
                "option": "[Scroll.]"
            }
        ]
    },
    {
        "id": "41112",
        "msg": [
            "w duude wtf",
            "w i'm just helping out with autumn's reunion with a friend. it's not stalking.",
            "w it's not like i'm spying on a rando or anything weird like that. idk if i'll even find them lmao."
        ],
        "options": [
            {
                "option": "[Scroll.]",
                "jumpto": "411111"
            }
        ]
    },
    {
        "id": "411111",
        "msg":[
            "r Not a friend. An 'acquaintance'.",
            "w so? still not a complete stranger.",
            "r Fine. If you say so.",
            "r Good luck, Autumn."
        ],
        "options": [
            {
                "option": "Thank you, Zoe.",
                "jumpto": "2(1)33(1)1(2)1122"
            }
        ]
    }
]